tap "adembc/tap"
tap "alexsjones/llmfit"
tap "anomalyco/tap"
tap "devmegablaster/devmegablaster"
tap "jeffreywildman/virt-manager"
tap "steipete/tap"
tap "supabase/tap"
tap "updatest/tap", "https://github.com/updatest/tap.git"
brew "glib"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "btop"
brew "commitizen"
brew "cryptography"
brew "curl"
brew "docker"
brew "doctl"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "libtiff"
brew "gh"
brew "git-delta"
brew "irssi"
brew "lazygit"
brew "libusb"
brew "marksman"
brew "mas"
brew "md5deep"
brew "mise"
brew "neovim"
brew "nvm"
brew "pv"
brew "pyenv"
brew "qt@5"
brew "pyqt@5"
brew "python@3.12"
brew "qemu"
brew "rclone"
brew "rkhunter"
brew "sd"
brew "starship"
brew "tealdeer"
brew "terminal-notifier"
brew "tmux"
brew "uv"
brew "wget"
brew "ykman"
brew "yq"
brew "zoxide"
brew "adembc/tap/lazyssh"
brew "alexsjones/llmfit/llmfit"
brew "anomalyco/tap/opencode"
brew "jeffreywildman/virt-manager/virt-viewer"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "4k-video-downloader+"
cask "aldente"
cask "alt-tab"
cask "altserver"
cask "arc"
cask "atomic-wallet"
cask "audacity"
cask "background-music"
cask "balenaetcher"
cask "betterdisplay"
cask "blood-on-the-clocktower-online"
cask "brave-browser"
cask "calibre"
cask "carbon-copy-cloner"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "clickup"
cask "steipete/tap/codexbar"
cask "crossover"
cask "cursor"
cask "cyberduck"
cask "daisydisk"
cask "db-browser-for-sqlite"
cask "devutils"
cask "dropbox"
cask "element"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "handbrake-app"
cask "hiddenbar"
cask "hyper"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "jan"
cask "jordanbaird-ice@beta"
cask "jumpcut"
cask "karabiner-elements"
cask "keybase"
cask "latexit", args: { appdir: "/Applications/TeX" }
cask "linear-linear"
cask "lm-studio"
cask "logi-options+"
cask "logitech-g-hub"
cask "loom"
cask "malwarebytes"
cask "mamp"
cask "megasync"
cask "milanote"
cask "moom"
cask "moonlight"
cask "mounty"
cask "neohtop"
cask "nextcloud"
cask "nomachine"
cask "devmegablaster/devmegablaster/notch-pilot"
cask "notion"
cask "nudge"
cask "obsidian"
cask "openrgb"
cask "orbstack"
cask "orion"
cask "parallels"
cask "parallels-toolbox"
cask "pgadmin4"
cask "pocket-casts"
cask "postman"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "rectangle"
cask "rider"
cask "samsung-magician"
cask "screenflick"
cask "sejda-pdf"
cask "send-to-kindle"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "subler"
cask "sublime-text"
cask "sunsama"
cask "superhuman"
cask "synologyassistant"
cask "teamviewer"
cask "telegram"
cask "texmaker"
cask "texshop", args: { appdir: "/Applications/TeX" }
cask "textual"
cask "tg-pro"
cask "thebrowsercompany-dia"
cask "transmission"
cask "typora"
cask "updatest/tap/updatest@beta"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "webex"
cask "whatsapp"
cask "xiv-on-mac"
cask "yed"
cask "yubico-yubikey-manager"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "aSPICE", id: 1560593107
mas "Bear", id: 1091189122
mas "BetterSnapTool", id: 417375580
mas "Bonsai Time Tracker", id: 1432799040
mas "Brother iPrint&Scan", id: 1193539993
mas "d20", id: 1156311750
mas "Dynaper", id: 1435296403
mas "Endurance", id: 1590043284
mas "Fantastical", id: 975937182
mas "Flighty", id: 1358823008
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Habits", id: 1514915737
mas "iMazing Profile Editor", id: 1487860882
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "iStudiez Pro", id: 402989379
mas "Jira", id: 1475897096
mas "John's Background Switcher", id: 907640277
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "reMarkable", id: 1276493162
mas "Screencast", id: 1368905598
mas "Sequel Ace", id: 1518036000
mas "Sofa", id: 1276554886
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "TickTick", id: 966085870
mas "Todoist", id: 585829637
mas "Toggl Track", id: 1291898086
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "aessoft.aessoft-class-autocomplete"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "austenc.laravel-blade-spacer"
vscode "austenc.laravel-docs"
vscode "bencoleman.armview"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "bschulte.php-autocomplete"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "cjhowe7.laravel-blade"
vscode "clemenspeters.format-json"
vscode "codingyu.laravel-goto-view"
vscode "continue.continue"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gamunu.vscode-yarn"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "heybourn.headwind"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "icrawl.discord-vscode"
vscode "in4margaret.compareit"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "james-yu.latex-workshop"
vscode "jgclark.vscode-todo-highlight"
vscode "johnpapa.vscode-peacock"
vscode "mathematic.vscode-latex"
vscode "mathiasfrohlich.kotlin"
vscode "mimarec.swagger-doc-viewer"
vscode "mohamedbenhida.laravel-intellisense"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-codeoptimizations.code-optimizations-preview"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rosshamish.kuskus-kusto-syntax-highlighting"
vscode "ryannaddy.laravel-artisan"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tomaustin.azure-devops-yaml-pipeline-validator"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "webhint.vscode-webhint"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
uv "claude-monitor"
